{
    "topbar": {
        "home": "Início",
        "resume": "Currículo",
        "projects": "Projetos",
        "skills": "Habilidades"
    },
    "home": {
        "dev_name": "Olá, eu sou Eduardo",
        "dev_role": "DESENVOLVEDOR ML/IA",
        "dev_welcome": "Bem-vindo ao meu portfólio",
        "linkedin": "Ver meu Linkedin"
    },
    "resume": {
        "my_experience": "Minha experiência",
        "view_resume": "Ver meu Currículo",
        "education": "Educação",
        "undergraduate": "Graduação em Ciência da Computação",
        "university": "Universidade Federal de Pernambuco",
        "companies": {
            "amigo_tech": {
                "name": "Amigo Tech",
                "date": "03/2025 - o momento",
                "positions": [
                    {
                        "title": "Engenheiro de Machine Learning",
                        "bullets": [
                            "Atuou no desenvolvimento de APIs com FastAPI para expor serviços de Machine Learning a outras squads internas.",
                            "Criou agentes de IA utilizando LangGraph e LangChain para a construção da lógica conversacional, com monitoramento de custos via LangSmith. Trabalhou com servidores MCP para melhor encapsulação das tools utilizadas.",
                            "Implementou uma feature chave para a squad, paralelizando um processamento intensivo de visão computacional pesado, reduzindo o tempo de execução em ~46%."
                        ]
                    }
                ]
            },
            "neurotech": {
                "name": "Neurotech",
                "date": "02/2023 - 03/2025",
                "positions": [
                    {
                        "title": "Engenheiro de Machine Learning",
                        "date": "11/2023 - 03/2025",
                        "bullets": [
                            "Alcançou a maior venda da história da squad, atingindo 9x a meta estipulada para o ano no contrato total, ao aplicar um algoritmo desenvolvido em Python que combina modelos de aprendizado de máquina com base em desempenho e custo, em uma prova de conceito com um dos 10 maiores bancos do Brasil.",
                            "Desenvolveu projetos de P&D voltados ao avanço do estado da arte nas técnicas utilizadas pelos cientistas de dados.",
                            "Conduzi reuniões estratégicas para compartilhar conhecimento sobre técnicas amplamente utilizadas em machine learning, incluindo interpretabilidade de modelos no processo de auditoria interna de grandes bancos e estratégias de feature engineering."
                        ]
                    },
                    {
                        "title": "Engenheiro de Machine Learning (Estágio)",
                        "date": "02/2023 - 11/2023",
                        "bullets": [
                            "Contribuiu para o desenvolvimento de bibliotecas internas, acelerando o processo de estudo e experimentação dos cientistas de dados da companhia.",
                            "Participou da concepção de soluções para bancos e instituições financeiras, abordando desafios em todo o ciclo de crédito."
                        ]
                    }
                ]
            },
            "voxar_labs": {
                "name": "Voxar Labs",
                "date": "0/2023 - 02/2024",
                "positions": [
                    {
                        "title": "Engenheiro de Machine Learning",
                        "date": "01/2023 - 02/2023",
                        "bullets": [
                            "Participou do desenvolvimento de uma solução para inspeção de torres de transmissão, utilizando drones para captura de imagens em campo, com foco na classificação de anomalias e defeitos, reduzindo significativamente o esforço manual na análise de imagens, na maioria sem anomalias.",
                            "Implantou a arquitetura de produção dos modelos que compunham a solução, containerizando-os e servindo-os em uma infraestrutura Kubernetes no Azure (AKS), além de configurar um dashboard de monitoramento utilizando Grafana."
                        ]
                    },
                    {
                        "title": "Engenheiro de Machine Learning",
                        "date": "08/2022 - 12/2022",
                        "bullets": [
                            "Realizou pesquisa e experimentação de algoritmos estado da arte no campo de aprendizado federado, adaptando frameworks (i.e., Flower, PySyft) para atender às necessidades específicas do projeto.",
                            "Desenvolveu novos conjuntos de dados para apoiar pesquisadores do campo globalmente.",
                            "Publicou na conferência internacional VISAPP (Computer Vision Theory and Applications) o trabalho \"FedBID and FedDocs: A Dataset and System for Federated Document Analysis\"."
                        ]
                    }
                ]
            },
            "stellantis": {
                "name": "Stellantis",
                "date": "06/2022 - 09/2022",
                "positions": [
                    {
                        "title": "Engenheiro de Machine Learning (Estágio)",
                        "date": "06/2022 - 09/2022",
                        "bullets": [
                            "Desenvolveu uma aplicação para captura e detecção de códigos de barras em esteiras de produção automotiva no grupo Stellantis, reduzindo o erro de verificação manual em ~63%.",
                            "Utilizou YOLO para detecção de objetos e Tesseract como OCR."
                        ]
                    }
                ]
            },
            "aibox_lab": {
                "name": "AiBox Lab",
                "date": "05/2021 - 09/2021",
                "positions": [
                    {
                        "title": "Engenheiro de Machine Learning (Estágio)",
                        "date": "06/2021 - 08/2021",
                        "bullets": [
                            "Implementou um sistema para gerar métricas de análise textual, incluindo legibilidade, coerência e coesão, utilizando NLTK e SpaCy.",
                            "Aplicou essas métricas em um classificador de feedback textual professores universitários a gerenciar grandes volumes de avaliações individuais que alcançou 95.1% de acurácia em um conjunto de 1000 textos avaliados por professores reais, utilizando scikit-learn."
                        ]
                    }
                ]
            }
        }
    },
    "projects": {
        "title": "Projetos",
        "filter_by": "Filtrar por",
        "view_all": "Ver todos os projetos",
        "projects": [
            {
                "title": "Writing Test",
                "link": "https://github.com/Edu-p/writing-test",
                "description": "Uma plataforma web que acompanha e aprimora a proficiência em escrita em inglês de desenvolvedores por meio de análise baseada em IA.",
                "tags": [
                    "IA",
                    "PLN",
                    "Vue",
                    "Python"
                ]
            },
            {
                "title": "Detecção de Intenção",
                "link": "https://github.com/Edu-p/intent-detection",
                "description": "Modelo de PLN baseado em BERT para classificar intenções de usuários e buscar as três últimas intenções detectadas em um banco de dados.",
                "tags": [
                    "PLN",
                    "BERT",
                    "IA",
                    "Python"
                ]
            },
            {
                "title": "Reco - Negociação de Dívidas Condominiais",
                "link": "https://github.com/Edu-p/Reco",
                "description": "Plataforma web premiada que automatiza o processo de negociação para moradores inadimplentes de condomínios. 🏆 3 Prêmios.",
                "tags": [
                    "IA",
                    "Fullstack",
                    "Vue",
                    "Python"
                ]
            },
            {
                "title": "Mecanismo de Atenção",
                "link": "https://github.com/Edu-p/attention-mechanism",
                "description": "Implementação conceitual e prática de mecanismos de atenção com e sem PyTorch para tarefas de PLN.",
                "tags": [
                    "PLN",
                    "Deep Learning",
                    "PyTorch",
                    "Python"
                ]
            },
            {
                "title": "Concessão de Crédito",
                "link": "https://github.com/Edu-p/granting-of-credit",
                "description": "Projeto de ponta a ponta para análise de risco de crédito, envolvendo comparação de estudos de caso e construção de modelo de credit scoring.",
                "tags": [
                    "Finanças",
                    "Machine Learning",
                    "Python"
                ]
            },
            {
                "title": "Previsão de Vendas em Lojas",
                "link": "https://github.com/Edu-p/store-sales-forecast",
                "description": "Previsão de vendas para lojas Rossmann usando modelagem de séries temporais e técnicas de ML para prever as próximas 6 semanas.",
                "tags": [
                    "Séries Temporais",
                    "Previsão",
                    "Machine Learning",
                    "Python"
                ]
            },
            {
                "title": "Which Property",
                "link": "https://github.com/Edu-p/which-property",
                "description": "Projeto de insights orientados a dados para a House Rocket identificar as oportunidades de investimento imobiliário mais lucrativas.",
                "tags": [
                    "Ciência de Dados",
                    "Análise Exploratória",
                    "Python"
                ]
            }
        ]
    },
    "skills": {
        "title": "Habilidades",
        "table_view": "Visualização em Tabela",
        "graph_view": "Visualização em Gráfico"
    }
}